NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
            }
            /// else - input capture, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_DATA_PROCESSNG:
        {
            if(is_timer_update())
            {
                // reading data bits with period of PeriodOfDataBits ticks
                // start reading values from the middle of the very first bit of data (of the first byte)
                if(0 == rx_current_byte_pos && 0 == rx_current_bit_pos)
                {
                    htim3.Instance->ARR = PeriodOfDataBits;
                }

                if(rx_current_byte_pos < sizeof(DataFrame_t))///FIXME: check correctness of sizeof here
                {
                    // send current bit of current byte
                    if(rx_current_bit_pos < rx_total_bits)  // change to next state
                    {
                        // k-th bit of n: (n >> k) & 1
                        if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                        {
                            // set bit at the inversed position
                            ((uint8_t*)(&data_frame))[rx_current_byte_pos] |= 1 << (rx_total_bits - rx_current_bit_pos - 1);
                        }
                        /// no need to set bit to zero if signal is low, since all bits are initialized to zeros
                        rx_current_bit_pos++;
                    }
                    else
                    {
                        // process next word
                        rx_current_byte_pos++;
                        // reset current bit position
                        rx_current_bit_pos = 0;
                    }
                }// if(rx_current_byte_pos < rx_buffer_size)
                else
                {
                    // data has been received
                    // TODO: process data buffer
                    ReceiverState = RX_DATA_DONE;
                    // wait for the end of data frame
                    // e.g.remaining HalfPeriodOfDataBits before [the delay before] stop bit sequence
                    htim3.Instance->ARR = HalfPeriodOfDataBits;
                    HAL_TIM_Base_Start_IT(&htim3);
                }
            }// end of is_timer_update()
            /// else - input capture during data receiving, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_DATA_DONE:
        {
            if(is_timer_update())
            {
                // wait for the middle of low level part of stop sequence
                // e.g. half of the delay before the first immpulse of stop bit sequence
                // after the delay
                //HAL_TIM_IC_PWM_Start_IT(&htim4); TODO
                htim3.Instance->ARR = HalfPeriodOfStartStopBits;
                TransmitterState = RX_STOP_BIT_PROCESSING;
                StartStopSequenceReceiveState = STAGE_OFF0;
                break;
            }
            /// else - input capture during data receiving, nothing to do.
            /// TODO: turn off input capture timer when it is not supposed to be used
            break;
        }
        case RX_STOP_BIT_PROCESSING:
        {
            switch (StartStopSequenceReceiveState)
            {
                //low: off confirmation
                case STAGE_OFF0:
                {
                    if(is_low_level_in_correct_time())
                    {
                        // continue reading stop bit sequence with PeriodOfStartStopBits interval
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high rising edge: STAGE_OFF1 -> STAGE_ON1
                case STAGE_OFF0_ON1:
                {
                    // rising edge input capture
                    if(is_rising_edge_in_correct_time())
                    {
                        StartStopSequenceTransmitState = STAGE_ON1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high confirmation
                case STAGE_ON1:
                {
                    if(is_high_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //low falling edge: STAGE_ON1 -> STAGE_OFF1
                case STAGE_ON1_OFF1:
                {
                    if(is_falling_edge_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low: confirmation
                case STAGE_OFF1:
                {
                    if(is_low_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1_ON2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high rising edge: STAGE_OFF1 -> STAGE_ON2
                case STAGE_OFF1_ON2:
                {
                    // rising edge input capture
                    if(is_rising_edge_in_correct_time())
                    {
                         StartStopSequenceReceiveState = STAGE_ON2;
                         break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high confirmation
                case STAGE_ON2:
                {
                    // second pulse confrmation
                    if(is_high_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON2_OFF2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low falling edge: STAGE_ON2 -> STAGE_OFFF2
                case STAGE_ON2_OFF2:
                {
                    if(is_falling_edge_in_correct_time())
                    {
                        ReceiverState = RX_STOP_BIT_DONE;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    reset_receiver_state();
                    break;
                }
                default:
                {
                    reset_receiver_state();
                    break;
                }
            }

            break;
        }
        case RX_STOP_BIT_DONE:
        {
            // immediately after stop sequence, line should be low
            // low confirmation
            if(is_low_level_in_correct_time())
            {
                // we successfully received data, send corresponding event for listeners to read from the data buffer
                // TODO
                copy_data_frame_to_buffer(&data_frame);
            }
            reset_receiver_state();
            break;
        }
        default:
        {
            reset_receiver_state();
            break;
        }
    } // switch(ReceiverState)
}
void reset_receiver_state()
{
    ReceiverState = RX_WAITING_FOR_START_BIT;
    StartStopSequenceReceiveState = STAGE_0;
    HAL_TIM_Base_Stop_IT(&htim3);
}

bool is_rising_edge_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            if(abs(htim4.Instance->CCR1 - PeriodOfStartStopBits) <  max_delta_pwm)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_falling_edge_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC2) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC2) != RESET)
        {
            if(abs(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits) <  max_delta_pwm)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_high_level_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_low_level_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_timer_update()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            return true;
        }
    }
    return false;
}
bool is_rising_edge()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            return true;
        }
    }
    return false;
}
void copy_data_frame_to_buffer(DataFrame_t* df)
{
    arr[index].angle_graycode = df->angle_graycode;
    arr[index].beamer_id = df->beamer_id;
    arr[index].timer32_value = df->timer32_value;
    //memcpy(df, rx_data_frame_array, sizeof(rx_data_frame));
}

void nop(){}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
